load-test-results/metrics_20260113_224241.txt

Summary:
  Total:	2.7015 secs
  Slowest:	0.7450 secs
  Fastest:	0.1663 secs
  Average:	0.2368 secs
  Requests/sec:	18.5084
  

Response time histogram:
  0.166 [1]	|■
  0.224 [43]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.282 [0]	|
  0.340 [0]	|
  0.398 [0]	|
  0.456 [0]	|
  0.514 [0]	|
  0.571 [0]	|
  0.629 [1]	|■
  0.687 [0]	|
  0.745 [5]	|■■■■■


Latency distribution:
  10% in 0.1678 secs
  25% in 0.1699 secs
  50% in 0.1715 secs
  75% in 0.1766 secs
  90% in 0.7352 secs
  95% in 0.7436 secs
  0% in 0.0000 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0569 secs, 0.1663 secs, 0.7450 secs
  DNS-lookup:	0.0222 secs, 0.0000 secs, 0.2217 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0007 secs
  resp wait:	0.1791 secs, 0.1658 secs, 0.5745 secs
  resp read:	0.0007 secs, 0.0003 secs, 0.0041 secs

Status code distribution:
  [200]	50 responses